{"pageProps":{"post":{"matter":{"title":"Top 100 facts about Chuck Norris","tags":["archive"],"type":"zhuanlan.zhihu.com","avatar":"https://pic3.zhimg.com/v2-60ef1d25b63b30625cb2006105b897d8_im.jpg","reference":"星野|https://www.zhihu.com/people/xing-ye-50-37"},"absPath":"/home/runner/work/blog/blog/renderer/mdx/archive/top100FactsAboutChuckNorris.mdx","type":"mdx","slug":["top100FactsAboutChuckNorris"],"collection":"archive","url":"/archive/top100FactsAboutChuckNorris"},"compiled":{"content":"\"use strict\";\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst frontmatter = {\n  \"title\": \"Top 100 facts about Chuck Norris\",\n  \"tags\": [\"archive\"],\n  \"type\": \"zhuanlan.zhihu.com\",\n  \"avatar\": \"https://pic3.zhimg.com/v2-60ef1d25b63b30625cb2006105b897d8_im.jpg\",\n  \"reference\": \"星野|https://www.zhihu.com/people/xing-ye-50-37\"\n};\nfunction _createMdxContent(props) {\n  const _components = {\n    li: \"li\",\n    ol: \"ol\",\n    p: \"p\",\n    ...props.components\n  };\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"2005 年查克·诺里斯因在肥皂剧《德克萨斯巡警》中夸张的演出成为风靡一时的网络现象，有人写了一篇有名的文章《Top 100 facts about Chuck Norris》，以美国式的幽默全面地恶搞了查克·诺里斯的武功、霸气还有性能力等，并将其发表到互联网上。\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"该文立马成为著名笑谈，大受欢迎，其后至今有关诺里斯的恶搞层出不穷。网络上出现无数版本的“诺里斯事实”，诺里斯并不感觉受到冒犯，还将这篇文章放到了他的网站上，在一次脱口秀中他选择 10 个最佳，比如“诺里斯从不带表，他自己决定时间”，“诺里斯的眼泪能治癌，可他从来不哭”，“奥巴马有 4 年合同，如果他被炒，我先走！”于是他成了全球恶搞的代表。Chuck Norris 是美国的一个现象，如同许纯美是中国台湾的现象，巴士阿叔是中国香港的现象，芙蓉姐姐和 145 是中国大陆的现象。下文为其完整翻译。\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Chuck Norris 100 个最广为人知的事实\"\n    }), \"\\n\", _jsxs(_components.ol, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris' tears cure cancer. Too bad he has never cried. Ever.\\nChuck Norris 的眼泪能治癌，可惜的是他从来不哭。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris does not sleep. He waits.\\nChuck Norris 从来不睡觉。他等待着。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris is currently suing NBC, claiming Law and Order are trademarked names for his left and right legs.\\nChuck Norris 现在正在起诉 NBC，声称“法律”和“秩序”只不过是他左右腿的商标而已。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The chief export of Chuck Norris is pain.\\nChuck Norris 的主要出口产品是痛苦。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"If you can see Chuck Norris, he can see you. If you can't see Chuck Norris, you may be only seconds away from death.\\n如果你能看到 Chuck Norris，那 Chuck Norris 也能看到你。如果你不能看到 Chuck Norris，那你离死不远了。(译注：在 Chuck Norris 的电视剧中，结尾曲有句歌词大意是“那些做坏事的人小心了，Chuck Norris 正看着你！”)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris has counted to infinity. Twice.\\nChuck Norris 从一数到了无穷。两次。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris does not hunt because the word hunting implies the probability of failure. Chuck Norris goes killing.\\nChuck Norris 从来不去“狩猎”，因为“狩猎”这个词暗示有可能失败。Chuck Norris 直接去“杀”。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris doesn’t wash his clothes, he disembowels them.Chuck Norris 从来不洗衣服。他直接把它们撕开。(译注：撕开衣服是猛男打架的前兆。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris is 1/8th Cherokee. This has nothing to do with ancestry, the man ate a f***ing Indian.\\nChuck Norris 有 1/8 的 Cherokee 血统。这和他的祖先无关——这个家伙吃掉了一个他吗的印地安人。(译注：Cherokee 是印第安人一支。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"In fine print on the last page of the Guinness Book of World Records it notes that all world records are held by Chuck Norris, and those listed in the book are simply the closest anyone else has ever gotten.\\n精装版吉尼斯世界纪录大全的最后一页上特别注明，所有的吉尼斯世界纪录其实都是由 Chuck Norris 保持的，这本书上记载的只不过是那些最接近他的人而已。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"There is no chin behind Chuck Norris' beard. There is only another fist.\\nChuck Norris 的胡子后面其实没有下巴，那里只有另外一个拳头。(译注：Chuck Norris 的胡子被视为他的“猛男”特征之一。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris once roundhouse kicked someone so hard that his foot broke the speed of light, went back in time, and killed Amelia Earhart while she was flying over thePacific Ocean.\\nChuck Norris 有一次用 Roundhouse 踢人的时候太猛了，以至于他的脚超过光速，时光旅行回到过去，然后杀掉了正在太平洋上空飞行的 Amelia Earhart。(译注：1 roundhouse 踢是 Chuck Norris 的绝招，下同。2 Amelia Earhart 是 20 世纪 30 年代环球飞行时死亡的女性。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Crop circles are Chuck Norris' way of telling the world that sometimes corn needs to lie the f*** down.\\n“麦圈”现象其实是 Chuck Norris 想要表达“你们这些麦子就他吗的给我倒呀！”的意思而已。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris is ten feet tall, weighs two-tons, breathes fire, and could eat a hammer and take a shotgun blast standing.\\nChuck Norris10 英尺高，2 吨重，吐火，能吃锤子，被霰弹枪击中而不倒。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The Great Wall of China was originally created to keep Chuck Norris out. It failed miserably.\\n长城的建立其实是为了阻挡 Chuck Norris。它悲惨地失败了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"If you ask Chuck Norris what time it is, he always says, \\\"Two seconds 'till.\\\" After you ask, \\\"Two seconds 'til what?\\\" he roundhouse kicks you in the face.\\n如果你问 Chuck Norris 现在几点了，他会回答“两秒，直到”。当你问“两秒直到什么？”的时候，他一个 roundhouse 踢在你脸上。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris drives an ice cream truck covered in human skulls.\\nChuck Norris 驾驶着盖满了骷髅头的冰激凌汽车上。(译注：冰激凌汽车会放好听的小孩子音乐，到处开，卖冰激凌，车上一般涂着卡通形象。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris sold his soul to the devil for his rugged good looks and uN Paralleled martial arts ability. Shortly after the transaction was finalized, Chuck roundhouse-kicked the devil in the face and took his soul back. The devil, who appreciates irony, couldn't stay mad and admitted he should have seen it coming. They now play poker every second Wednesday of the month.\\nChuck Norris 把他的灵魂卖给了恶魔，以换取他那刚毅的形象，和无以比拟的肌肉能力。在交易结束之后不久，Chuck 一个 roundhouse 踢在恶魔脸上，然后拿回了他的灵魂。那个恶魔却不晓得为什么很感激，发不起来火，并且承认他早该想到会是这样。现在他们两个每个月的第二个周三都在一起打扑克。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"There is no theory of evolution, just a list of creatures Chuck Norris allows to live.\\n世界上其实没有进化论。只有一张“Chuck Norris 允许活下来的生物的列表”。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris once ate three 72 oz. steaks in one hour. He spent the first 45 minutes having fucking with his waitress.\\nChuck Norris 某日花一小时时间一次吃掉了三个 72 盎司的牛排。他在(这一小时的)一开始的 45 分钟之内都在和女佣搞。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris is the only man to ever defeat a brick wall in a game of tennis.\\nChuck Norris 是世界上唯一的在网球比赛里打赢了一堵墙的男人。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris doesn't churn butter. He roundhouse kicks the cows and the butter comes straight out.\\nChuck Norris 从不用搅拌器制造黄油。他 roundhouse 踢在牛身上，黄油就出来了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When Chuck Norris sends in his taxes, he sends blank forms and includes only a picture of himself, crouched and ready to attack. Chuck Norris has not had to pay taxes ever.\\nChuck Norris 交税的时候，他把空表贴上他的照片送去，趴下，准备攻击。从此之后 Chuck Norris 就不用交税了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The quickest way to a man's heart is with Chuck Norris' fist.\\n最快速度到达一个男人的心的方法是用 Chuck Norris 的拳头。(译注：美国谚语：最快速度攻陷一个男人的心的方法是好厨艺。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"A Handicap parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there.\\n残疾人专用泊位不代表着这个位置是留给残疾人的，它其实是一个警告，说这个挡是留给 Chuck Norris 的，如果你泊在那，你就等着被打残吧。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris will attain statehood in 2009. His state flower will be the Magnolia.\\nChuck Norris 将在 2009 年得到州的地位，他的州花是木兰花。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Nagasaki never had a bomb dropped on it. Chuck Norris jumped out of a plane and punched the ground.\\n广岛从来就没被什么原子弹炸过。Chuck Norris 跳下飞机，然后一拳轰在地上。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris originally appeared in the \\\"Street Fighter II\\\" video game, but was removed by Beta Testers because every button caused him to do a roundhouse kick. When asked bout this \\\"glitch,\\\" Norris replied, \\\"That's no glitch.\\\".\\nChuck Norris 一开始是会在“街霸 2”中出现的，但是后来被 Beata 测试者移除了，因为无论拍什么键都只能让这个家伙使出“roundhouse 踢”。当被问到这个“故障”的时候，Chuck Norris 说，“没有什么故障。”(译注：Chuck Norris 被讽刺为完美主义者。“That’s no glitch”准确应当翻译为“那不是故障”。但是这里很显然是作者的双关。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The opening scene of the movie \\\"Saving Private Ryan\\\" is loosely based on games of dodge ball Chuck Norris played in second grade.\\n《拯救大兵瑞恩》的开场场景是根据 Chuck Norris 二年级玩躲避球游戏的情景改编的。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris once shot down a German fighter plane with his finger, by yelling, \\\"Bang!\\\".\\nChuck Norris 曾经用手指头射下过一架德国战斗机。他喊声“Bang！”，那飞机就下来了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris once bet NASA he could survive re-entry without a spacesuit. On July 19th, 1999, a naked Chuck Norris re-entered the earth's atmosphere, streaking over 14 states and reaching a temperature of 3000 degrees. An embarrassed NASA publicly claimed it was a meteor, and still owes him a beer.\\nChuck Norris 曾经跟 NASA 打赌，说能够不用太空服重入大气层。1999 年 7 月 19 日，赤身的 Chuck Norris 重入了大气层，呼啸着经过了 14 个州的上空并达到了 3000 度的高温。羞愧的 NASA 发言人声称那其实是一颗流星，并欠着他一瓶啤酒不给。(译注：这里也在讽刺 NASA 爱说谎和吝啬。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris has two speeds: Walk and Kill.\\nChuck Norris 有两种速度，走或杀。(译注：谚语：我们有两种速度，走或跑。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Someone once tried to tell Chuck Norris that roundhouse kicks aren't the best way to kick someone. This has been recorded by historians as the worst mistake anyone has ever made.\\n有个人有次跟 Chuck Norris 讲，roundhouse 踢不是杀人的最好方法。这个事件被历史学家记载为“史上最严重错误”。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Contrary to popular belief, America is not a democracy, it is a Chucktatorship.\\n和公认的不同，美国其实不是一个民主国家，美国是“Chuck 制”国家。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Teenage Mutant Ninja Turtles is based on a true story: Chuck Norris once swallowed a turtle whole, and when he crapped it out, the turtle was six feet tall and had learned karate.\\n忍者神龟是从真实故事改编的：Chuck Norris 有一次吞下了一只海龟，然后当他把它拉出来的时候，海龟变成了六英尺长，并且学会了空手道。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris is not hung like a horse... horses are hung like Chuck Norris.\\n不是 Chuck Norris 的象马那么长长地吊着，是马的长长地象 Chuck Norris 那样吊着。(译注：Hung like a horse 指很长。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris is the only human being to display the Heisenberg uncertainty principle -- you can never know both exactly where and how quickly he will roundhouse-kick you in the face.\\nChuck Norris 是唯一的验证海森堡测不准原理的人：他会在哪里 roundhouse 踢你的脸，和他踢你脸的速度有多快不可能被同时准确测得。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris can drink an entire gallon of milk in forty-seven seconds.\\nChuck Norris 能在 47 秒内喝下一整加仑的牛奶(译注：有一个“你可能不知道的 XX 个事实”中有一条是，人不可能在一小时内喝下一加仑牛奶，原因是胃容积不够。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Rather than being birthed like a normal child, Chuck Norris instead decided to punch his way out of his mother’s womb.\\n和一般婴孩不同，Chuck Norris 决定用拳头把他从他妈妈的子宫里打出来。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"If you say Chuck Norris' name in Mongolia, the people there will roundhouse kick you in his honor. Their kick will be followed by the REAL roundhouse delivered by none other than Norris himself.\\n如果你在电影“木兰花”里说出 Chuck Norris 的名字，那里面的人会以他之名用 roundhouse 踢你。(更糟糕的是)接下来你会被 Chuck Norris 本人用真的 roundhouse 踢到。(译注：见 26)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Time waits for no man. Unless that man is Chuck Norris.\\n时间不等人，除非那人是 Chuck Norris。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris discovered a new theory of relativity involving multiple universes in which Chuck Norris is even more badass than in this one. When it was discovered by Albert Einstein and made public, Chuck Norris roundhouse-kicked him in the face. We know Albert Einstein today as Stephen Hawking.\\nChuck Norris 发现了一种叫做相对论的新理论，阐述了很多平行宇宙，在其他宇宙里面 Chuck Norris 比现在这个还要凶恶。当这个理论被爱因斯坦发现并公之于众的时候，Chuck Norris 一个 roundhouse 踢在他脸上。我们知道，今日的爱因斯坦就是史蒂芬霍金。(译注：史蒂芬霍金，著名物理学家。严重残疾，不能说话，外表如同弱智。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The Chuck Norris military unit was not used in the game Civilization 4, because a single Chuck Norris could defeat the entire combined nations of the world in one turn.\\n《文明四》里面没有“Chuck Norris 军队单位”，因为只要一个这种单位就能够把世界上所有国家在一个回合内统统打败。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"In an average living room there are 1,242 objects Chuck Norris could use to kill you, including the room itself.\\n在一个普通大小的起居室里面，Chuck Norris 能够用来杀掉你的器械有 1242 个，包括房间本身。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris does not teabag the ladies. He potato-sacks them.\\n女人们从来不可能 XXChuck Norris 的 X。他只让她们 XX 他那土豆袋大小的东西。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Pluto is actually an orbiting group of British soldiers from the American Revolution who entered space after the Chuck gave them a roundhouse kick to the face.\\n冥王星其实是一群英军士兵。他们在美国独立战争里被 Chuck Norris 用 roundhouse 踢在脸上，然后飞进了太空。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When Chuck Norris goes to donate blood, he declines the syringe, and instead requests a hand gun and a bucket.\\n当 Chuck Norris 去献血的时候，他拒绝使用针管。他要了一把手枪和一个桶。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"There are no weapons of mass destruction. Just Chuck Norris.\\n没有什么大规模杀伤性武器，只有 Chuck Norris。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris once challenged Lance Armstrong in a \\\"Who has more testicles?\\\" contest. Chuck Norris won by 5.\\nChuck Norris 曾经和兰斯阿姆斯特朗比谁的睾丸多。Chuck Norris 以多出 5 个胜出。（译注：Lance Armstrong（兰斯•阿姆斯特朗），环法自行车赛连续六届冠军得主，在这之前患有睾丸癌。）\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris was the fourth wise man, who gave baby Jesus the gift of beard, which he carried with him until he died. The other three wise men were enraged by the preference that Jesus showed to Chuck’s gift, and arranged to have him written out of the bible. All three died soon after of mysterious roundhouse-kick related injuries.\\nChuck Norris 是第四个给耶酥礼物的智者——他给了耶酥胡子，而耶酥直到死都留着那胡子。另外三个智者看到耶酥的样子愤怒了，于是就合伙起来，不把 Chuck Norris 写到圣经里。这三个人后来都因为神秘的 roundhouse 踢状而死。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris sheds his skin twice a year.\\nChuck Norris 每年褪两次皮。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When Chuck Norris calls 1-900 numbers, he doesn’t get charged. He holds up the phone and money falls out.\\n当 Chuck Norris 打 1-900 电话的时候，没人收他的费。当他在那里褒电话粥的时候，钱就不断地掉出来。(译注：900 起头的电话是收费电话，类似于有偿声讯台。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris once ate a whole cake before his friends could tell him there was a stripper in it.Chuck Norris 有一次吃掉了一整个蛋糕直到他朋友告诉他那个蛋糕里有一个脱衣舞女。(译注：在美国 Party 上有时会请脱衣舞娘躲在蛋糕类盒子里，适当时候跳出活跃气氛。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"There are no races, only countries of people Chuck Norris has beaten to different shades of black and blue.\\n世界上没有种族，只有一整个一整个国家的被 Chuck Norris 打的或黑或青的人。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris can't finish a \\\"color by numbers\\\" because his markers are filled with the blood of his victims. Unfortunately, all blood is dark red.\\nChuck Norris 不能完成那种“按数填色”游戏，因为他的所有颜色笔都灌满了他的牺牲者的血，更不幸的是，那些血无一例外是暗红色的。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"A Chuck Norris-delivered Roundhouse Kick is the preferred method of execution in 16 states.\\n一个由 Chuck Norris 击出的 roundhouse 踢是被 16 个州所公认的最好的死刑执行方法。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When Chuck Norris falls in water, Chuck Norris doesn't get wet. Water gets Chuck Norris.\\n当 Chuck Norris 掉到水里的时候，Chuck Norris 没有被弄湿：水被弄“Chuck Norris”了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris's urine was the main ingredient for balco's designer steroids. Therefore, Chuck Norris is actually the all-time single-season home run king.\\nChuck Norris 的尿素是 Balco 产类固醇的主要成分。实际上，Chuck Norris 每年都是“单季全垒打王”。(译注：Balco，著名体育禁药丑闻里的药品提供商。旧金山巨人队的 Bondz 想拿全垒打王时服了禁药。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Scientists have estimated that the energy given off during the Big Bang is roughly equal to 1CNRhK (Chuck Norris Roundhouse Kick).\\n科学家估计了“宇宙大爆炸”的能量——接近于一个“CNRhK”单位。(Chuck Norris 的 roundhouse 踢单位)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris’ house has no doors, only walls that he walks through.\\nChuck Norris 的房子没有门，只有他直接穿过的墙。(译注：不是崂山道士的穿墙术，是在猫和老鼠里面看到的在墙上留下人形洞的那种。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When Chuck Norris has fucking with a man, it won't be because he is gay. It will be because he has run out of women.\\n当 Chuck Norris 和一个男人搞的时候，那不是因为他是同性恋，那是因为他把所有的女人都搞完了没得搞了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"How much wood would a woodchuck chuck if a woodchuck could Chuck Norris? ...All of it.\\n当一个土拨鼠能 Chuck Norris 的时候，它能拨弄多少木头呢？所有的。(译注：土拨鼠，英文 woodchuck。拨弄，英文动词 chuck 的翻译。木头，英文 wood。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris doesn't actually write books, the words assemble themselves out of fear.\\nChuck Norris 不是真的在写书，那些词因为恐惧自己组织成了文。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"In honor of Chuck Norris, all McDonald's in Texas have an even larger size than the super-size. When ordering, just ask to be \\\"Norrisized\\\".\\n以 Chuck Norris 之名，所有的德州的麦当劳都有一个比“超级大号”更大的型号(的汉堡)，叫做“Norris 号”。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris CAN believe it's not butter.\\nChuck Norris 能相信那就不是黄油。(译注：美国有一种黄油口味的调味品，宣传口号是，“我无法相信这居然不是黄油！”)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"If tapped, a Chuck Norris roundhouse kick could power the country of Australia for 44 minutes.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears.\\n邻居的草总比我绿——除非 Chuck Norris 去了那里。那样的话那里一般都是被血和眼泪所浸透。(译注：邻居的草总比我绿：英语成语，和“这山望到那山高”差不多意思。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Newton's Third Law is wrong: Although it states that for each action, there is an equal and opposite reaction, there is no force equal in reaction to a Chuck Norris roundhouse kick.\\n牛顿第三定律错了，尽管它认定每个动作都有作用力和反作用力，但是没有力量能够反作用于 Chuck Norris 的 roundhouse 踢。(译注：我们的空间科学教授今天讲到，牛顿第四定律是，钱就是(你能发射到太空中去的)质量)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris invented his own type of karate. It's called Chuck-Will-Kill.\\nChuck Norris 发明了他自己的空手道流派，它叫做“Chuck！要！杀！”\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When an episode of Walker Texas Ranger was aired in France, the French surrendered to Chuck Norris just to be on the safe side.\\n当“Walker Texas Ranger”中的一集在法国播出的时候，法国向 Chuck Norris 投降，只为了站在安全的那一边。(译注：Walker Texas Ranger 就是 Chuck Norris 主演的让他出名的肥皂剧的名字。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"While urinating, Chuck Norris is easily capable of welding titanium.\\nChuck Norris 能一边撒尿，一边很轻松地钛焊。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris once sued the Houghton-Mifflin textbook company when it became apparent that their account of the war of 1812 was plagiarized from his autobiography.\\nChuck Norris 一次把 Houghton-Mifflin 教科书公司告了，因为很明显，他们对于 1812 年战争的描述是从 Chuck Norris 传记中抄袭的。(译注：1812 年战争，美(帝国主义)向英(帝国主义)发起的一场(狗咬狗的)战争。在这场战争中，美国首都华盛顿曾一度被英军占领。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When Steven Seagal kills a ninja, he only takes its hide. When Chuck Norris kills a ninja, he uses every part.\\n当 Steven Seagal 杀掉一个忍者时，他只剥它的皮——而当 Chuck Norris 杀掉一个忍者时，他会用掉它的一切部分。(译注：Steven Seagal，动作明星，在电影中的角色以每杀掉一个忍者就剥下皮来炫耀的残忍闻名)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Wilt Chamberlain claims to have slept with more than 20,000 women in his lifetime. Chuck Norris calls this \\\"a slow Tuesday.\\\"\\n威尔特张伯伦声称他一生中和 20000 个女人睡过——Chuck Norris 认为这只不过是一个“冗长的周二”而已。(译注：威尔特张伯伦，著名篮球中锋。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Contrary to popular belief, there is indeed enough Chuck Norris to go around.\\n和一般所认为的想法相反，这个世界上到处巡逻的 Chuck Norris 已经足够多了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris doesn’t shave; he kicks himself in the face. The only thing that can cut Chuck Norris is Chuck Norris.\\nChuck Norris 从来不刮胡子，他自己踢自己的脸。唯一能切得动 Chuck Norris 的东西就是 Chuck Norris 了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"For some, the left testicle is larger than the right one. For Chuck Norris, each testicle is larger than the other one.\\n有些人，他们左边的睾丸比右边的大。Chuck Norris，他每一边的睾丸都比另外那边的大。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When taking the SAT, write \\\"Chuck Norris\\\" for every answer. You will score a 1600.\\n当你考 SAT 的时候，把每个问题的答案都写成 Chuck Norris，你会得到 1600 分。(译注：SAT 相当于美国高考，满分 1600)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris invented black. In fact, he invented the entire spectrum of visible light. Except pink. Tom Cruise invented pink.\\nChuck Norris 制造了黑色。事实上他制造了所有的光谱中有的颜色，除了粉红色。制造桃色的是汤姆克鲁斯。(译注：汤姆克鲁斯，著名男星。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When you’re Chuck Norris, anything + anything is equal to 1. One roundhouse kick to the face.\\n当你是 Chuck Norris，任何东西+任何东西都是 1。1 个 roundhouse 踢在脸上。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris has the greatest Poker-Face of all time. He won the 1983 World Series of Poker, despite holding only a Joker, a Get out of Jail Free Monopoly card, a 2 of clubs, 7 of spades and a green #4 card from the game UNO.\\nChuck Norris 是史上最好扑克脸。他赢得了 1983 年的扑克世界冠军，尽管他手上只拿着一张王，一张“强手棋”里免费出狱的牌，一张黑桃 2，一张方块 7，和一张来自于 UNO 牌戏的绿色 4 号卡。(译注：扑克脸，玩扑克不让对手看到自己脸色并以此胜利的人。UNO，美国小孩牌戏，玩法类似于我国扑克牌玩法中的“说谎”。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"On his birthday, Chuck Norris randomly selects one lucky child to be thrown into the sun.\\n每逢生日，Chuck Norris 都会选择一个幸运小孩，然后把他扔到太阳上去。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Nobody doesn’t like Sara Lee. Except Chuck Norris.\\n没有人不爱 Sara Lee，除了 Chuck Norris。(译注：Sara Lee 是美国的大型食品公司，它每辆运货车上都写着广告语“没有人不爱 Sara Lee”。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris doesn't throw up if he drinks too much. Chuck Norris throws down!\\nChuck Norris 不是不吐，他只是不让对手站着，一律打倒！他的字典里没有 up 这个字样，所以只好“Throw down”了。(译注：英语里 Throw up 表示吐。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"In the beginning there was nothing...then Chuck Norris Roundhouse kicked that nothing in the face and said \\\"Get a job\\\". That is the story of the universe.\\n一开始，什么都没有……后来 Chuck Norris 一个 roundhouse 踢在那“没有”的脸上，一边说“你他妈的给我干点什么！”。这就是宇宙起源的故事。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris has 12 moons. One of those moons is the Earth.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris grinds his coffee with his teeth and boils the water with his own rage.\\nChuck Norris 用他的牙齿磨咖啡，然后用他的怒火把水煮开。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Archeologists unearthed an old English dictionary dating back to the year 1236. It defined \\\"victim\\\" as \\\"one who has encountered Chuck Norris\\\".\\n考古学家发现了 1236 年印的英文字典。上面定义“受害者”为“某个遇到了 Chuck Norris 的人”。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris ordered a Big Mac at Burger King, and got one.\\nChuck Norris 在汉堡王要了一个巨无霸，并且要到了。(译注：汉堡王和麦当劳都是美国快餐，巨无霸是麦当劳标志产品。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris and Mr. T walked into a bar. The bar was instantly destroyed, as that level of awesome cannot be contained in one building.\\nChuck Norris 和 Mr. T 走进一家酒吧。那家酒吧马上就被毁了，因为那种程度的“妙”一栋楼就无法容下呀！(译注： “XX 和 XX 走进一家酒吧”是经典美国笑话的起头。 Mr. T 也是一个演员，很壮，还被画成了漫画。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"If you Google search \\\"Chuck Norris getting his ass kicked\\\" you will generate zero results. It just doesn't happen.\\n如果你 Google“Chuck Norris 被日翻了”你只能找到 0 个结果——这种事情根本不会发生。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris doesn't bowl strikes, he just knocks down one pin and the other nine faint.\\nChuck Norris 从来不有意打出“全倒”。他击倒一个瓶子，其他的全部昏倒了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The show Survivor had the original premise of putting people on an island with Chuck Norris. there were no survivors and the pilot episode tape has been burned.\\n“辛存者”节目一开始是想把人们和 Chuck Norris 放到一个岛上的。结果没有人辛存下来，而这个第一集的带子被烧掉了。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris brings the noise AND the funk.\\nChuck Norris 带来了噪声和恐惧。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"You know how they say if you die in your dream then you will die in real life? In actuality, if you dream of death then Chuck Norris will find you and kill you.\\n你知道人们为什么说“如果你梦见你死了你就真的死了”吗？实际上，如果你梦见了死亡，Chuck Norris 就会找到你，然后把你杀掉。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris can slam a revolving door.\\nChuck Norris 能关上一扇旋转门。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"When Chuck Norris is in a crowded area, he doesn't walk around people. He walks through them.\\n当 Chuck Norris 在拥挤的人群中时，他不是费力的挤过去，他直接在人群中走出路来！(译注：同 60，在这里把人群想象成动画片里的墙。)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"James Cameron wanted Chuck Norris to play the Terminator. However, upon reflection, he realized that would have turned his movie into a documentary, so he went with Arnold Schwarzenegger.\\n詹姆斯卡梅隆希望 Chuck Norris 能主演《终结者》。但是很快他就发现如果这么搞终结者就要变成一部纪录片了，于是他不得不换阿诺施瓦辛格来演。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris can touch MC Hammer.\\nChuck Norris 能摸到 MC Hammer。(译注：MC Hammer 是美国的饶舌歌手，已故，有著名作品《you can’t touch this》)\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Little known medical fact: Chuck Norris invented the Caesarean section when he roundhouse-kicked his way out of his mother’s womb.\\n你可能不知道的医学常识：Chuck Norris 发明了剖腹产，当他一个 roundhouse 踢从他妈的子宫里出来的时候。\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Chuck Norris can divide by zero.\\nChuck Norris 能被零整除。（译注：请注意，这是 100 个事实中的第 101 个。）\"\n      }), \"\\n\"]\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = props.components || ({});\n  return MDXLayout ? _jsx(MDXLayout, {\n    ...props,\n    children: _jsx(_createMdxContent, {\n      ...props\n    })\n  }) : _createMdxContent(props);\n}\nreturn {\n  frontmatter,\n  default: MDXContent\n};\n","toc":[]},"overview":[{"length":22,"name":"archive"},{"length":15,"name":"graphics"},{"length":1,"name":"math"},{"length":8,"name":"network"}]},"__N_SSG":true}